{
    "truths": [
      "What's your biggest fear?",
      "Have you ever lied to your best friend?",
      "Who do you have a crush on?",
      "What’s a secret you’ve never told anyone?",
      "Have you ever cheated in an exam?",
      "What’s your weirdest habit?",
      "What’s the most embarrassing thing you’ve done?",
      "Have you ever stalked someone online?",
      "What was your last search on Google?",
      "Do you talk to yourself?",
      "Have you ever faked being sick to skip something?",
      "Have you ever had feelings for a teacher?",
      "What's something illegal you've done?",
      "Do you have a finsta or secret account?",
      "What’s your guilty pleasure?",
      "What's the wildest thing you've searched online?",
      "What's a rumor you spread or helped spread?",
      "Have you ever sent a message to the wrong person?",
      "Have you ever been in love?",
      "Do you keep secrets from your parents?",
      "What’s your worst rejection story?",
      "Have you ever been catfished?",
      "Who in this group would you date?",
      "Ever been caught watching something inappropriate?",
      "What's your favorite romantic fantasy?",
      "Would you ever date someone from this group?",
      "What's something you're ashamed of but still do?",
      "Do you still check your ex's profile?",
      "Have you lied to get out of trouble in this group?",
      "What’s your biggest insecurity?",
      "How often do you think about sex?",
      "Have you ever flirted just to get something?",
      "What's your body count?",
      "Do you believe in friends with benefits?",
      "What’s the dirtiest message you’ve sent?",
      "Would you ever send a spicy pic?",
      "What's your most recent dream about someone here?",
      "Have you ever skinny-dipped?",
      "What’s your wildest online encounter?",
      "Would you rather be rich or famous?",
      "What would you do if no one could judge you?",
      "Have you ever cried after hooking up?",
      "What’s something you’ve done while drunk/high?",
      "Ever kissed someone you didn’t like?",
      "What turns you on the most?",
      "Do you enjoy sexting?",
      "What’s your favorite body part on yourself?",
      "What’s a turn-off during a kiss?",
      "Do you prefer lights on or off?",
      "Have you fantasized about someone in this chat?",
      "What’s your ideal first date night?"
    ],
    "dares": [
      "Send a heart emoji to your crush.",
      "Sing a song in the group (voice note).",
      "Do 10 push-ups and send a video.",
      "Change your profile picture to something funny.",
      "Say 'I love you' to the next person who texts you.",
      "Type the alphabet backwards in 20 seconds.",
      "Tell a joke that's so bad it's funny.",
      "Post an embarrassing photo of yourself.",
      "Talk in emoji only for the next 5 minutes.",
      "Act like a monkey for 30 seconds on VC.",
      "Send a screenshot of your recent chats (blur names if needed).",
      "Record yourself saying something random backwards.",
      "Message your crush 'I miss you' and share screenshot.",
      "Put 'I'm crazy' in your bio for 10 mins.",
      "Record a fake crying video and post it here.",
      "Send a voice note of your best animal impression.",
      "Post your last selfie in the group.",
      "Create a meme with your own face and share it.",
      "Act like a cat for 1 minute in voice chat.",
      "Send the last 3 photos from your gallery.",
      "Draw something ugly and send a pic.",
      "Make a fake breakup status and screenshot it.",
      "Type with your nose for the next message.",
      "Record a fake 'confession' video to the group.",
      "Post your search history screenshot.",
      "Change your nickname in group to 'Loser' for 10 mins.",
      "Send your oldest saved Messenger conversation (blur if needed).",
      "Voice note singing a romantic song to a random member.",
      "Do a dare given by another player.",
      "Make a reel or short singing or lip syncing and post it here.",
      "Post a random photo with no context.",
      "Make a fake love proposal post with your name tagged.",
      "Talk like a robot in voice for 30 seconds.",
      "React with 'love' to 10 random posts in your feed.",
      "Ask a random group member for a video call and screenshot.",
      "Write 'I pee in pools' and post in your story (screenshot).",
      "Use a pickup line on a random member.",
      "Text someone 'I have a crush on you' and share the reply.",
      "Change your Messenger theme to pink and show screenshot.",
      "Copy and paste the last 3 messages you sent today.",
      "Pretend to be someone else in the group for 2 minutes.",
      "Record a short 'roast yourself' video.",
      "Send a voice note singing like you're drunk.",
      "Send your live location (1 min only).",
      "Make a poll in the group asking 'Am I cute?'",
      "Voice note laughing like a villain.",
      "Share a screenshot of your battery % right now.",
      "Draw your crush and share the drawing.",
      "Do 10 squats and record it.",
      "Pretend to be your favorite celeb in voice note.",
      "Type a message with your eyes closed.",
      "Voice note confessing something fake but believable."
    ]
  }
